[Timeout] BlockStatement
nest-test/src/payment/payment.service.ts:12:5
 
   constructor(@Inject('PAYMENT_TYPE')private readonly paymentTypes : IPaymentType[]
 
-  ) {
-    this.paymentTypesMap = paymentTypes.reduce((theMap, currentValue) => {
-     
-      theMap.set(currentValue.getType(), currentValue) 
-      return theMap;
-      
-  }, new Map<string, IPaymentType>())
-  }
+  ) {}
 
 

[Timeout] BlockStatement
nest-test/src/payment/payment.service.ts:13:74
   constructor(@Inject('PAYMENT_TYPE')private readonly paymentTypes : IPaymentType[]
 
   ) {
-    this.paymentTypesMap = paymentTypes.reduce((theMap, currentValue) => {
-     
-      theMap.set(currentValue.getType(), currentValue) 
-      return theMap;
-      
-  }, new Map<string, IPaymentType>())
+    this.paymentTypesMap = paymentTypes.reduce((theMap, currentValue) => {}, new Map<string, IPaymentType>())
   }
 

[Timeout] BlockStatement
nest-test/src/payment/payment.service.ts:22:28
   }
 
 
-  pay(paymentDetails : any){
-    const paymentProcessor = this.paymentTypesMap.get(paymentDetails.type)
-    if (paymentProcessor) return paymentProcessor.payS(paymentDetails)
-    else throw new Error("can't handle that payment type")
-} 
+  pay(paymentDetails : any){} 
 
 }

[Timeout] ConditionalExpression
nest-test/src/payment/payment.service.ts:24:9
 
   pay(paymentDetails : any){
     const paymentProcessor = this.paymentTypesMap.get(paymentDetails.type)
-    if (paymentProcessor) return paymentProcessor.payS(paymentDetails)
+    if (false) return paymentProcessor.payS(paymentDetails)
     else throw new Error("can't handle that payment type")
 } 

[Timeout] ConditionalExpression
nest-test/src/payment/payment.service.ts:24:9
 
   pay(paymentDetails : any){
     const paymentProcessor = this.paymentTypesMap.get(paymentDetails.type)
-    if (paymentProcessor) return paymentProcessor.payS(paymentDetails)
+    if (true) return paymentProcessor.payS(paymentDetails)
     else throw new Error("can't handle that payment type")
 } 

[NoCoverage] StringLiteral
nest-test/src/payment/payment.service.ts:25:26
   pay(paymentDetails : any){
     const paymentProcessor = this.paymentTypesMap.get(paymentDetails.type)
     if (paymentProcessor) return paymentProcessor.payS(paymentDetails)
-    else throw new Error("can't handle that payment type")
+    else throw new Error("")
 } 
 
