[NoCoverage] BlockStatement
src/payment/strategy/payment-type-pix.ts:6:23
 
 @Injectable()
 export class PaymentTypePix implements IPaymentType {
-    getType(): string {
-        return 'pix'
-    }
+    getType(): string {}
     
     payS(paymentDetails : any) {

[NoCoverage] StringLiteral
src/payment/strategy/payment-type-pix.ts:7:16
 @Injectable()
 export class PaymentTypePix implements IPaymentType {
     getType(): string {
-        return 'pix'
+        return ""
     }
     

[NoCoverage] BlockStatement
src/payment/strategy/payment-type-pix.ts:10:32
         return 'pix'
     }
     
-    payS(paymentDetails : any) {
-
-
-        return "pagando com pix"
-    }
+    payS(paymentDetails : any) {}
 
 }

[NoCoverage] StringLiteral
src/payment/strategy/payment-type-pix.ts:13:16
     payS(paymentDetails : any) {
 
 
-        return "pagando com pix"
+        return ""
     }
 
