[NoCoverage] BlockStatement
src/payment/strategy/payment-type-whats.ts:6:23
 
 @Injectable()
 export class PaymentTypeWhats implements IPaymentType {
-    getType(): string {
-        return 'whatsapp'
-    }
+    getType(): string {}
     
     payS(paymentDetails : any) {

[NoCoverage] StringLiteral
src/payment/strategy/payment-type-whats.ts:7:16
 @Injectable()
 export class PaymentTypeWhats implements IPaymentType {
     getType(): string {
-        return 'whatsapp'
+        return ""
     }
     

[NoCoverage] BlockStatement
src/payment/strategy/payment-type-whats.ts:10:32
         return 'whatsapp'
     }
     
-    payS(paymentDetails : any) {
-
-        return "pagando com whatsapp"
-    }
+    payS(paymentDetails : any) {}
 
 }

[NoCoverage] StringLiteral
src/payment/strategy/payment-type-whats.ts:12:16
     
     payS(paymentDetails : any) {
 
-        return "pagando com whatsapp"
+        return ""
     }
 
