[Timeout] BlockStatement
nest-test/src/payment/payment.controller.ts:12:36
   }
 
   @Post()
-  pay(@Body() paymentDetails: any) {
-    
-    return this.paymentService.pay(paymentDetails);
-    
-  }
+  pay(@Body() paymentDetails: any) {}
 
 }
